Repository: LeP-Ton/eliminate-teris-1
Catalog: Sources/Resources/*.lproj/Localizable.strings
Languages: ja, ko, ru, zh_hans

# window.title
source: Eliminate Teris 1
ja: テリス消去1
ko: 테리스 제거 1
ru: Устранение Терис 1
zh_hans: 消除俄罗斯方块1

# window.subtitle
source: Pixel Touch Bar Challenge
ja: ピクセル Touch Bar チャレンジ
ko: 픽셀 Touch Bar 챌린지
ru: Пиксельный вызов Touch Bar
zh_hans: 像素风触控栏方块挑战

# panel.settings
source: Game Settings
ja: ゲーム設定
ko: 게임 설정
ru: Настройки игры
zh_hans: 游戏设置

# panel.status
source: Time & Score
ja: 時間とスコア
ko: 시간 및 점수
ru: Время и счёт
zh_hans: 时间与得分

# status.ready
source: READY
ja: 待機
ko: 대기
ru: ГОТОВО
zh_hans: 待机

# status.running
source: RUNNING
ja: プレイ中
ko: 진행중
ru: ИГРА
zh_hans: 进行中

# status.finish
source: FINISH
ja: 終了
ko: 종료
ru: ФИНИШ
zh_hans: 结束

# status.combo
source: COMBO x%d
ja: コンボ x%d
ko: 콤보 x%d
ru: КОМБО x%d
zh_hans: 连击 x%d

# instructions.text
source: Activate this app and play on the Touch Bar. Drag tiles to swap them; match 3 or more to clear. Multi-touch swapping is supported.
ja: アプリをアクティブにして、Touch Bar でプレイしてください。 タイルをドラッグして入れ替え、3 個以上そろえると消去されます。 マルチタッチでの入れ替えに対応しています。
ko: 앱을 활성화한 뒤 Touch Bar에서 플레이하세요. 타일을 드래그해 교환하고, 3개 이상 맞추면 제거됩니다. 멀티터치 교환을 지원합니다.
ru: Активируйте приложение и играйте на Touch Bar. Перетаскивайте плитки, чтобы менять их местами; 3 и более подряд исчезают. Поддерживается мультитач-обмен.
zh_hans: 请先激活应用，再在触控栏上游玩。 拖动方块交换位置，连成 3 个及以上即可消除。 支持多点触控交换。

# language.label
source: Language
ja: 言語
ko: 언어
ru: Язык
zh_hans: 语言

# language.english
source: English
ja: 英語
ko: 영어
ru: Английский
zh_hans: 英语

# language.chinese
source: Chinese
ja: 中国語
ko: 중국어
ru: Китайский
zh_hans: 简体中文

# language.japanese
source: Japanese
ja: 日本語
ko: 일본어
ru: Японский
zh_hans: 日语

# language.korean
source: Korean
ja: 韓国語
ko: 한국어
ru: Корейский
zh_hans: 韩语

# language.russian
source: Russian
ja: ロシア語
ko: 러시아어
ru: Русский
zh_hans: 俄语

# mode.label
source: Mode
ja: モード
ko: 모드
ru: Режим
zh_hans: 模式

# mode.free
source: Free
ja: フリー
ko: 자유
ru: Свободный
zh_hans: 自由

# mode.score_attack
source: Score Attack
ja: スコアアタック
ko: 점수전
ru: На очки
zh_hans: 竞分

# mode.speed_run
source: Speed Run
ja: スピードラン
ko: 스피드런
ru: На скорость
zh_hans: 竞速

# option.time
source: Time
ja: 時間
ko: 시간
ru: Время
zh_hans: 时间

# option.target_score
source: Target
ja: 目標スコア
ko: 목표 점수
ru: Цель
zh_hans: 目标分数

# option.minute_format
source: %d min
ja: %d分
ko: %d분
ru: %d мин
zh_hans: %d 分钟

# option.target_format
source: %d pts
ja: %d点
ko: %d점
ru: %d очк.
zh_hans: %d 分

# start.label
source: Action
ja: 状態
ko: 상태
ru: Состояние
zh_hans: 状态

# start.action_start
source: Start
ja: 開始
ko: 시작
ru: Старт
zh_hans: 开始

# start.action_restart
source: Restart
ja: やり直し
ko: 다시 시작
ru: Начать заново
zh_hans: 重新开始

# hud.score_attack
source: Score: %d Time Left: %@
ja: スコア: %d 残り時間: %@
ko: 점수: %d 남은 시간: %@
ru: Очки: %d Осталось: %@
zh_hans: 得分：%d 剩余时间：%@

# hud.speed_run
source: Score: %d/%d Time: %@
ja: スコア: %d/%d 経過時間: %@
ko: 점수: %d/%d 경과 시간: %@
ru: Очки: %d/%d Время: %@
zh_hans: 得分：%d/%d 已用时间：%@

# result.waiting_start
source: Ready. Click Start to begin.
ja: 準備完了。開始を押すとスタートします。
ko: 준비 완료. 시작을 누르면 타이머가 시작됩니다.
ru: Готово. Нажмите «Старт», чтобы начать.
zh_hans: 准备就绪，点击开始后计时。

# result.score_attack_finished
source: Time's up! Final score: %d
ja: 時間切れ！最終スコア: %d
ko: 시간 종료! 최종 점수: %d
ru: Время вышло! Итоговые очки: %d
zh_hans: 时间到！最终得分：%d

# result.speed_run_finished
source: Target reached in %@
ja: %@ で目標達成
ko: %@ 만에 목표 달성
ru: Цель достигнута за %@
zh_hans: 达成目标，用时 %@

# panel.records
source: Challenge Records
ja: チャレンジ記録
ko: 챌린지 기록
ru: Рекорды испытаний
zh_hans: 挑战记录

# panel.rules
source: Mode Briefing
ja: ルール説明
ko: 플레이 규칙
ru: Правила режима
zh_hans: 玩法说明

# panel.records.with_mode
source: Challenge Records (%@)
ja: チャレンジ記録（%@）
ko: 챌린지 기록 (%@)
ru: Рекорды испытаний (%@)
zh_hans: 挑战记录（%@）

# records.empty
source: No records yet.
ja: 記録はまだありません。
ko: 아직 기록이 없습니다.
ru: Пока нет рекордов.
zh_hans: 暂无纪录

# records.date_format
source: yyyy-MM-dd
ja: yyyy年MM月dd日
ko: yyyy년 MM월 dd일
ru: dd.MM.yyyy
zh_hans: yyyy年MM月dd日

# records.metric.score
source: %d pts
ja: %d点
ko: %d점
ru: %d очк.
zh_hans: %d分

# records.score_attack.line
source: %d. %d pts · %@%@
ja: %d. %d点 ・ %@%@
ko: %d. %d점 · %@%@
ru: %d. %d очк. · %@%@
zh_hans: %d. %d分 · %@%@

# records.speed_run.line
source: %d. %@ · %d/%d pts%@
ja: %d. %@ ・ %d/%d点%@
ko: %d. %@ · %d/%d점%@
ru: %d. %@ · %d/%d очк.%@
zh_hans: %d. %@ · %d/%d分%@

# rules.category.core
source: Core Rules
ja: 基本ルール
ko: 기본 규칙
ru: Базовые правила
zh_hans: 基础规则

# rules.category.mode
source: Mode Rules
ja: モード別ルール
ko: 모드 규칙
ru: Правила режимов
zh_hans: 模式规则

# rules.category.goal
source: Settlement Rules
ja: 決着ルール
ko: 종료 규칙
ru: Условия завершения
zh_hans: 结算规则

# rules.core.line1
source: Drag tiles on the Touch Bar to swap positions; match 3+ to clear.
ja: Touch Bar 上でタイルをドラッグして入れ替え、3 個以上そろえると消去されます。
ko: Touch Bar에서 타일을 드래그해 위치를 바꾸고, 3개 이상 맞추면 제거됩니다.
ru: Перетаскивайте плитки на Touch Bar; 3 и более подряд очищаются.
zh_hans: 在触控栏拖动方块交换位置，连成 3 个及以上即可消除。

# rules.core.line2
source: Multi-touch swapping is supported; chain clears help build a score gap.
ja: マルチタッチでの入れ替えに対応し、連続消去でスコア差を広げやすくなります。
ko: 멀티터치 교환을 지원하며, 연속 제거 시 점수 격차를 벌리기 쉽습니다.
ru: Поддерживается мультитач-обмен; серии очисток помогают увеличить отрыв по очкам.
zh_hans: 支持多点触控交换，连续消除会更容易拉开分差。

# rules.mode.free
source: Free: No timer and no target score; ideal for control practice.
ja: フリー：時間制限と目標スコアがなく、操作練習向けです。
ko: 자유: 시간 제한과 목표 점수 없이 자유롭게 연습합니다.
ru: Свободный: без лимита времени и целевого счёта, подходит для тренировки.
zh_hans: 自由：无时间与目标分数限制，可持续练习操作。

# rules.mode.score_attack
source: Score Attack: Earn as many points as possible within %d/%d/%d minutes.
ja: スコアアタック：%d/%d/%d 分の制限時間内で高得点を狙います。
ko: 점수전: %d/%d/%d분 제한 시간 안에 최대 점수를 노립니다.
ru: На очки: наберите максимум очков за %d/%d/%d минут.
zh_hans: 竞分：在 %d/%d/%d 分钟倒计时内尽可能拿到更高分。

# rules.mode.speed_run
source: Speed Run: Reach %d/%d/%d points as quickly as possible.
ja: スピードラン：%d/%d/%d 点に最短時間で到達することを目指します。
ko: 스피드런: %d/%d/%d점을 가장 빠르게 달성하는 모드입니다.
ru: На скорость: достигните %d/%d/%d очков как можно быстрее.
zh_hans: 竞速：以最短时间达到 %d/%d/%d 分目标。

# rules.goal.free
source: Free: No win/lose settlement, used for practice only.
ja: フリー：勝敗判定はなく、練習専用です。
ko: 자유: 승패 판정 없이 연습용으로만 사용합니다.
ru: Свободный: без победы/поражения, только для практики.
zh_hans: 自由：不判定胜负，仅用于练习与手感调整。

# rules.goal.score_attack
source: Score Attack: Settles when countdown ends, ranked by final score.
ja: スコアアタック：時間切れで終了し、最終スコアで順位付けします。
ko: 점수전: 시간이 끝나면 종료되며 최종 점수로 순위를 매깁니다.
ru: На очки: завершение по таймеру, рейтинг по итоговому счёту.
zh_hans: 竞分：倒计时归零后结算，以最终得分排名。

# rules.goal.speed_run
source: Speed Run: Settles immediately after target score is reached, ranked by elapsed time.
ja: スピードラン：目標到達で即終了し、経過時間で順位付けします。
ko: 스피드런: 목표 점수 달성 즉시 종료되며 경과 시간으로 순위를 매깁니다.
ru: На скорость: завершение сразу после цели, рейтинг по времени.
zh_hans: 竞速：达到目标分后立即结算，以用时排名。

# rules.current.free
source: Current Mode: Free (No timer / No target score)
ja: 現在モード：フリー（時間制限なし / 目標スコアなし）
ko: 현재 모드: 자유 (시간 제한 없음 / 목표 점수 없음)
ru: Текущий режим: Свободный (без таймера / без цели по очкам)
zh_hans: 当前模式：自由（无时间限制 / 无目标分数）

# rules.current.score_attack
source: Current Mode: Score Attack (Current tier: %@)
ja: 現在モード：スコアアタック（現在の設定：%@）
ko: 현재 모드: 점수전 (현재 설정: %@)
ru: Текущий режим: На очки (текущий уровень: %@)
zh_hans: 当前模式：竞分（当前档位：%@）

# rules.current.speed_run
source: Current Mode: Speed Run (Current target: %@)
ja: 現在モード：スピードラン（現在の目標：%@）
ko: 현재 모드: 스피드런 (현재 목표: %@)
ru: Текущий режим: На скорость (текущая цель: %@)
zh_hans: 当前模式：竞速（当前目标：%@）
